Model: "SHM_Unet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 128, 128, 64) 128         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 64) 36928       instance_normalization[0][0]     
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 128, 128, 64) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 64, 64, 64)   0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 64, 128)  73856       average_pooling2d[0][0]          
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 64, 64, 128)  256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 64, 128)  147584      instance_normalization_2[0][0]   
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 64, 64, 128)  256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 32, 32, 128)  0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 256)  295168      average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 32, 32, 256)  512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 256)  590080      instance_normalization_4[0][0]   
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 32, 32, 256)  512         conv2d_5[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 16, 16, 256)  0           instance_normalization_5[0][0]   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 512)  1180160     average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 16, 16, 512)  1024        conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 512)  2359808     instance_normalization_6[0][0]   
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 16, 16, 512)  1024        conv2d_7[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 8, 8, 512)    0           instance_normalization_7[0][0]   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 8, 8, 512)    262656      average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 8, 8, 512)    1024        conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 8, 8, 512)    262656      instance_normalization_8[0][0]   
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 8, 8, 512)    1024        conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 16, 16, 512)  2359808     instance_normalization_9[0][0]   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 1024) 0           conv2d_transpose[0][0]           
                                                                 instance_normalization_7[0][0]   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 16, 16, 512)  4719104     concatenate[0][0]                
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 16, 16, 512)  1024        conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 512)  2359808     instance_normalization_10[0][0]  
__________________________________________________________________________________________________
instance_normalization_11 (Inst (None, 16, 16, 512)  1024        conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 32, 32, 256)  1179904     instance_normalization_11[0][0]  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 512)  0           conv2d_transpose_1[0][0]         
                                                                 instance_normalization_5[0][0]   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 32, 256)  1179904     concatenate_1[0][0]              
__________________________________________________________________________________________________
instance_normalization_12 (Inst (None, 32, 32, 256)  512         conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 256)  590080      instance_normalization_12[0][0]  
__________________________________________________________________________________________________
instance_normalization_13 (Inst (None, 32, 32, 256)  512         conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 64, 64, 128)  295040      instance_normalization_13[0][0]  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 256)  0           conv2d_transpose_2[0][0]         
                                                                 instance_normalization_3[0][0]   
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 128)  295040      concatenate_2[0][0]              
__________________________________________________________________________________________________
instance_normalization_14 (Inst (None, 64, 64, 128)  256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 64, 128)  147584      instance_normalization_14[0][0]  
__________________________________________________________________________________________________
instance_normalization_15 (Inst (None, 64, 64, 128)  256         conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 128, 128, 64) 73792       instance_normalization_15[0][0]  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 128 0           conv2d_transpose_3[0][0]         
                                                                 instance_normalization_1[0][0]   
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 128, 128, 64) 73792       concatenate_3[0][0]              
__________________________________________________________________________________________________
instance_normalization_16 (Inst (None, 128, 128, 64) 128         conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 128, 128, 64) 36928       instance_normalization_16[0][0]  
__________________________________________________________________________________________________
instance_normalization_17 (Inst (None, 128, 128, 64) 128         conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 1)  65          instance_normalization_17[0][0]  
==================================================================================================
Total params: 18,531,265
Trainable params: 18,531,265
Non-trainable params: 0
__________________________________________________________________________________________________
